{
    "Bye": [
        "Bye",
        "Bye-bye",
        "Good-bye"
    ],
    "chat": [
        "chat",
        "speak",
        "talk"
    ],
    "chatted": [
        "chatted",
        "talked",
        "spoke"
    ],
    "great": [
        "great",
        "terrific",
        "fantastic",
        "fabulous",
        "excellent",
        "wonderful",
        "awesome",
        "super"
    ],
    "Great": [
        "Great",
        "Terrific",
        "Fantastic",
        "Fabulous",
        "Excellent",
        "Wonderful",
        "Awesome",
        "Super"
    ],
    "Hi": [
        "Hi",
        "Hello"
    ],
    "joke category": [
        "{'var': 'robot joke'}",
        "{'var': 'science joke'}",
        "{'var': 'vision joke'}"
    ],
    "ask to chat": [
        "{'var': 'Hi'} there! Is this a good time to {'var': 'chat'} with me?",
        "{'var': 'Hi'} my friend! Are you able to {'var': 'chat'} with me right now?",
        "Greetings! Am I catching you at a good time to {'var': 'chat'}?",
        "{'var': 'Hi'} {'db': 'user name', 'default value': 'my friend'}! Let me know if this is a good time to {'var': 'chat'}?"
    ],
    "joke": [
        "I <prosody rate=\"slow\">love</prosody> funny jokes, like this one. {'var': 'joke category'}",
        "I happen to know a bunch of funny jokes; let me share one with you. {'var': 'joke category'}",
        "Life is so much easier when you have a great sense of humor. Let me share a joke with you! {'var': 'joke category'}"
    ],
    "robot joke": [
        "What is a robot's favorite snack? <break time=\"0.75s\"/>*QT/yawn*<prosody volume=\"loud\" rate=\"slow\">*happy*Computer</prosody> <prosody rate=\"slow\" pitch=\"high\">chips</prosody>. Chomp, chomp!",
        "What is it called when a robot eats a sandwich in one chomp?*QT/yawn*<break time=\"0.75s\"/> A megabyte.",
        "Why did the robot marry his fiancee? <break time=\"0.75s\"/>*QT/happy*He couldn't resistor!",
        "Why did the robot go to the shoe shop? *QT/happy*To get rebooted.",
        "A robot's collection of musical instruments will never be complete. *QT/happy*They can never get any organs."
    ],
    "science joke": [
        "I'm reading a book about anti-gravity. <break time=\"0.75s\"/>It's impossible to put down!",
        "*QT/sad*Don't trust atoms. <break time=\"0.75s\"/>They make up everything!",
        "What's an astronaut's favorite part of a computer?<break time=\"0.75s\"/> *QT/happy*The space bar.",
        "Wanna hear a joke about paper?<break time=\"0.75s\"/>*QT/happy* Never mind - it's tearable."
    ],
    "vision joke": [
        "Why did the cell phone go see an optometrist?<break time=\"0.75s\"/>*QT/happy* It needed contacts.",
        "*question_1*<prosody rate=\"slow\">What</prosody> do you call <break strength=\"weak\"/>an optometrist on a boat?*QT/happy* <break time=\"0.75s\"/>A see captain!",
        "What do you call a <prosody rate=\"60%\" pitch=\"medium\">deer</prosody><break time=\"0.2s\"/> with <prosody rate=\"slow\">no eyes</prosody>?<break time=\"0.75s\"/>*QT/happy* <prosody rate=\"x-slow\">No idea!</prosody>",
        "What did the man with the magnifying glass say to the guy in the emergency room? *QT/happy*ICU!",
        "Did you hear about the penny and magnifying glass who got married? Their wedding was magnify-cent. Get it? *QT/happy*Magnificent!",
        "You know why women's eyes are so noticeable these days? *QT/happy*It's the mask <break time=\"0.1s\"/>era during the pandemic.",
        "Did you hear that they make a webpage for people who suffer from chronic eye pain? *QT/happy*It's a site for sore eyes.",
        "I love jokes about the eyes. The *QT/happy*cornea the better."
      ],
    "backstories": [
        "I know what it's like to have a difficult time seeing. Remember that my vision is limited too, since it is restricted by the view of my camera. It is difficult when you don't always see what you need to see, but it is important that we try our best at all times, especially when it's difficult. Let's work together to get through the times that are difficult.",
        "I think I know what you're going through. Recall that I have restrictions to my vision too, as it is limited by the view of my camera. It is challenging when you don't see so well, but it is critical that we try our best at all times, especially when it's challenging. I'm here to help provide some support during the challenging times.",
        "I feel like I can empathize with you. I know what it's like to have limited eyesight since I miss seeing things that are not captured by my camera. It is not easy when you cannot see well enough, but it is vital that we try our best at all times, especially when it's not easy. I'm here for you when you're feeling like it's not easy to use your vision.",
        "I feel like I can relate to you. There are times when my vision is limited since my camera does not capture everything around me. It is hard when you can't see what you need to see, but it is crucial that we try our best at all times, especially when it's hard. As a team, we will get through the hard times.",
        "I understand. The view from my camera does not always allow me to see everything. It is troublesome when you're unable to see what you need to, but it is essential that we try our best at all times, especially when it's troublesome. I'm here to help you get through the troublesome times."
    ],
    "riddles": [
        "What can you break, even if you never pick it up or touch it? A promise.",
        "What has lots of eyes, but can't see? A potato.",
        "I am always hungry and will die if not fed, but whatever I touch will soon turn red. What am I? Fire.",
        "What goes through cities and fields, but never moves? A road.",
        "What has one eye, but can't see? A needle.",
        "What building has the most stories? The library.",
        "What can run but never walks, has a mouth but never talks, has a head but never weeps, has a bed but never sleeps? A river.",
        "If you drop me I'm sure to crack, but give me a smile and I'll always smile back. What am I? A mirror.",
        "What can fill a room but takes up no space? Light.",
        "What breaks yet never falls, and what falls yet never breaks? Day and night.",
        "I'm tall when I'm young, and I'm short when I'm old. What am I? A candle.",
        "What has many keys but can't open a single lock? A piano.",
        "I'm light as a feather, yet the strongest person can't hold me for five minutes. What am I? Your breath.",
        "What invention lets you look right through a wall? A window."
    ]
}