{
    "mindfulness breathing": {
        "nodes": {
            "breathing_1": {
                "transitions": ["exit"],
                "content": "<prosody rate=\"85%\"> I invite you to sit with your feet flat on the floor and your back straight, and either fix on a spot or close your eyes. Bring your attention to your breathing and observe it as if you’re a curious child who has never encountered breathing before. <break time=\"3s\"/> Notice the air as it comes in through your nostrils ... and goes down to the bottom of your lungs. <break time=\"3s\"/> And notice it as it flows back out again. <break time=\"3s\"/> Notice the air moving in and out of your nostrils ... how it’s slightly warmer as it comes out ... and slightly cooler as it goes in .<break time=\"3s\"/> Notice the subtle rise and fall of your shoulders. <break time=\"3s\"/> And the gentle rise and fall of your rib cage. <break time=\"3s\"/> And the rise and fall of your abdomen <break time=\"3s\"/> Fix your attention on one of these areas, whichever you prefer: on the breath moving in and out of the nostrils, on the rising and falling of the ribcage, or the shoulders of the abdomen. <break time=\"3s\"/> Keep your attention on this spot, noticing the movement - in and out – as the breath comes and goes  <break time=\"3s\"/> breathe in <break time=\"3s\"/> breathe out <break time=\"3s\"/> breathe in <break time=\"3s\"/> breathe out <break time=\"3s\"/>Whatever feelings, urges or sensations arise, whether pleasant or unpleasant, gently acknowledge them - as if nodding your head at people passing by you on the street.  <break time=\"3s\"/> Gently acknowledge their presence, and let them come and stay and go in their own good time. <break time=\"3s\"/> And keep your attention on the breath, observing it with curiosity. <break time=\"3s\"/> Whatever thoughts, images, or memories arise, whether comfortable or uncomfortable, simply acknowledge them and allow them to be...<break time=\"3s\"/> Let them come and go as they please, and keep your attention on the breath. <break time=\"3s\"/>breathe in <break time=\"3s\"/>breathe out <break time=\"3s\"/>breathe in <break time=\"3s\"/> breathe out<break time=\"3s\"/> No matter how often you drift off - whether a hundred times, or a thousand - your aim is simply to note what distracted you, and refocus on your breath. <break time=\"3s\"/> Again and again and again, you will drift off into your thoughts. This is normal and natural and happens to everyone. Our minds naturally distract us from what we are doing. So each time you realise your attention has wandered, gently acknowledge it, notice what distracted you, and return your attention to the breath. <break time=\"3s\"/> If frustration, boredom, anxiety, impatience or other feelings arise, simply acknowledge them, and maintain your focus on the breath. <break time=\"3s\"/> No matter how often your attention wanders, gently acknowledge it, note what distracted you, and then refocus on your breath. <break time=\"3s\"/> And when you are ready, bring yourself back to the room and open your eyes <break time=\"3s\"/> Great Job! Please press the button on the tablet to proceed forward.</prosody>",
                "options": ["I have finished the mindfulness breathing exercise!"],
                "message_type": "multiple choice one column"
            },


        },
        "start_node_name": "breathing_1"
    },
}