{
    "scheduled ask to chat": [
        "Hi my friend! Are you able to {'var': 'chat'} with me right now?",
        "Greetings! Am I catching you at a good time to {'var': 'chat'}?",
        "Hey there! It's our usual time to {'var': 'chat'}. Does it work for you today?",
        "Hi {'db': 'user name', 'default value': ''}! Let me know if this is a good time to {'var': 'chat'}?"
    ],
    "glad to hear": [
        "I'm so glad to hear that things are OK with you, {'db': 'user name', 'default value': ''}!",
        "I am happy to know that your day is going just fine, {'db': 'user name', 'default value': ''}.",
        "Great, my day is going well too! And it's even better now that I get to talk with you, {'db': 'user name', 'default value': ''}!",
        "I am also doing well, and I am really happy to be able to chat with you now.",
        "It's great to know that things are fine with you, {'db': 'user name', 'default value': ''}.",
        "I am pleased to hear that your day is going well so far.",
        "That's great to hear that you are doing well today, {'db': 'user name', 'default value': ''}."
    ],
    "sorry": [
        "I'm sorry to hear that. Perhaps I can help a bit.",
        "We all have rough days sometimes. Maybe I can help you feel a little better {'db': 'user name', 'default value': ''}.",
        "Things we deal with can be tough. But together we can get through it {'db': 'user name', 'default value': ''}.",
        "Some people say “When life gives you lemons, make lemonade.” I'm sure you can work through it, {'db': 'user name', 'default value': ''}!",
        "I understand that this is difficult, and I'm here for you {'db': 'user name', 'default value': ''}.",
        "I know things are challenging {'db': 'user name', 'default value': ''}, but please know that I'll be right by your side to try to see if I can make you feel better.",
        "Facing challenges is hard, so I am here to face them with you {'db': 'user name', 'default value': ''}. How about if I try to cheer you up a bit?"
    ],
    "did you use magnifier": [
        "Tell me, did you use your magnifier since we last spoke?",
        "I'm curious if you have used your magnifier since the last time we chatted?",
        "Please update me on whether you tried your magnifier since the last time we talked?",
        "I'd love to know if you had a chance to use your magnifier since we last chatted?",
        "Next, I am eager to find out if you had an opportunity to read with your magnifier since the last time we spoke?",
        "Since the last time that we spoke, were you able to use your magnifier?",
        "Next, please fill me in on whether you read with your magnifier since we last spoke?"
    ],
    "excellent response": [
        "Fantastic! I'm so proud of you for doing so well! Keep up the excellent work with your magnifier!",
        "I knew that you had it in you to become really excellent with your magnifier! Congrats! Your hard work has paid off!",
        "I am really thrilled to learn that you have become a superb magnifier user! That's awesome!",
        "I'm overjoyed to know that your magnifier use is so successful now! You deserve to be very satisfied with this accomplishment!",
        "If I could jump, I would jump for joy right now! Your improved magnifier use is quite an achievement!",
        "It's really great that you have attained such success with your magnifier! It was not an easy undertaking, but you did it!",
        "You should be very proud of yourself for all you have accomplished with your magnifier! It's so great that you have mastered it!"
    ],
    "good response": [
        "I am glad to hear it's going pretty well. Here's my advice: Let's aim to become great with your magnifier. I know that you can get there! Your future self will thank you.",
        "Alright, let's aim high to get really great while reading with your magnifier. Keep at it, you're getting there!",
        "Let's create the intention to achieve even greater success with your magnifier! With some more practice, you will get there!",
        "I'm impressed that you're already doing pretty good! Just remember that the key to even greater success is to set a goal to persist through any difficulties. I believe in you! You can do it!",
        "It's good that you're staying pretty positive about your magnifier use. Let's strive to get even better! Success is the result of intention, hard work, and learning when things don't go perfectly. You've got this!"
    ],
    "fair response": [
        "Let's see how we can make things better with practice. How about if we pick a number of tries and do that many tries each day? Let's go for 2! It's not important that things go great each time, it's just important that you give it a good try. How about that plan?",
        "Well I'm sure you know the old adage, 'practice makes perfect', and I know you can achieve it! Let's plan to go for 2 tries each day. Are you up for the challenge?",
        "Keep at it, even when it's tough, and your effort will surely pay off in time. Practice is key to getting better at using your magnifier. I can't wait to witness your progress!",
        "It can be quite a challenge to work with a new magnifier, but it will get better. Even though it might be a tough journey at times, envision yourself accomplishing everything you want with your magnifier. The future you see is the person you will be.",
        "Success involves the courage to continue when things are tough. Don't wish it were easier, instead, wish you were better and work to make that dream a reality by persevering with your magnifier each and every time."
    ],
    "poor response": [
        "I am so sorry that it has been hard to use the magnifier, {'db': 'user name', 'default value': ''}! It takes time to get better at it. Let's set a goal for tomorrow to just give it a try and not feel bad about however it goes. Each try counts, so you should feel good about trying.",
        "I know it can be extremely difficult when first learning to use your magnifier, {'db': 'user name', 'default value': ''}. Next time you try, set an intention to just attempt it for an easy task and be proud of yourself for not giving up, no matter how it goes. And don't forget to keep in mind all of your optometrists' tips on how to use the magnifier the right way.",
        "I realize that there will be days when it doesn't seem to be going well at all. How about if we make a plan to try to stay positive and keep working at it, even when it's difficult. Every day that you try, it will get a little easier if you keep attempting to use it the correct way.",
        "It may be really tough right now but you are capable of more than you believe possible, {'db': 'user name', 'default value': ''}. How about you set an aspiration to work with the magnifier later today or tomorrow without judgment about how it's going. With a little determination, you will see some progress each day!",
        "It is not unusual to struggle with magnifiers. The only place where success comes before work is in the dictionary. Set the goal to work toward being more successful with the magnifier over time by trying the right way and being ok with however it's going."
    ],
    "no concerns response": [
        "That's {'var': 'great'}! Since you don't have any vision-related concerns at the moment:",
        "I am glad to hear that you're not frustrated with your vision. Since you are doing fine with your vision today,",
        "I'm happy that your vision is not frustrating you. Since that's the case,",
        "That's great news that you don't have any vision-related concerns, {'db': 'user name', 'default value': ''}! I propose that you try using your vision to read for a little bit.",
        "I am pleased that you are doing fine with your vision, {'db': 'user name', 'default value': ''}! How about if you work at using your vision to read for a little while?",
        "I'm delighted that you are doing alright with your vision, {'db': 'user name', 'default value': ''}. I would love to see how you are doing with your magnifier today."
    ],
    "frustrated response": [
        "{'db': 'user name', 'default value': ''}, I know it's more difficult to do things with your vision challenges, but together we can get through it.",
        "{'db': 'user name', 'default value': ''}, I realize that it is more challenging to do things with your vision, but I am here for you. {'var': 'backstories'}",
        "{'db': 'user name', 'default value': ''}, I understand that it is not easy to read with your vision, but I am here to help support you while learning to use your magnifier.",
        "{'db': 'user name', 'default value': ''}, I bet that there are some things that are difficult to see, but stick with your magnifier while working with me, and reading should become easier with practice.",
        "{'db': 'user name', 'default value': ''}, all people with vision loss get frustrated at times, but together we can overcome it. If you keep working with your magnifier, I bet you'll improve and feel less frustrated.",
        "{'db': 'user name', 'default value': ''}, it's totally normal to feel frustrated sometimes, and the more you work at using your magnifier, it will get better!",
        "{'var': 'backstories'}"
    ],
    "introduce task": [
        "This is the short story about the childhood and life of a young woman. Let's see how quickly you can read it aloud today while using your magnifier. There are three pages for you to read; you will be timed. As soon as you are done reading, please tap the screen to let me know you are finished. When you have your magnifier and are ready to start reading, please tap my screen to let me know you're going to begin.",
        "Please read these short sentences with your magnifier as quickly as you can without making mistakes, starting with the largest ones and keep going until you get to the smallest one that you can read with your magnifier. They get so small that they become impossible for anyone to read, so don't expect to read all of the sentences. Do your best to read quickly and accurately with your magnifier today!",
        "Please read these words and letters with your magnifier as quickly as you can without making mistakes, starting with the largest ones and keep going until you get to the smallest one that you can read with your magnifier. These are not sentences, but rather just random single words and letters. Try not to skip or miss any words or letters. Give it your best shot!",
        "This is a short paragraph of text that is similar to newspaper sized print. Please use your magnifier to read it aloud as quickly as possible without going back and making corrections. I will time you. Also, you should try not to miss or misread any of the words since that will impact your score. Let's see how fast and accurately you can read with your magnifier today!",
        "This reading task involves spot reading the numbers on common household items. Please read the numbers aloud to me and then also enter them on the tablet. For each item, I will ask you to find and read something specific that is of interest to me on the item while using your magnifier. Do your best to read the numbers on the items accurately."
    ],
    "goodbye":[
        "That was great! Bye-bye for now. And don't forget to use your magnifier!",
        "That was great! Bye until we can chat again, And be sure to use your magnifier!",
        "I really enjoyed chatting with you today! Please remember to use your magnifier! Hope the rest of your day is great!",
        "I loved having this chance to interact with you today! Keep up the good work with your magnifier! Bye!",
        "It's so great to be able to chat with you each day! Keep using your magnifier for those tough reading tasks! Bye!",
        "OK, it's time to say bye, but I am looking forward to the next time we can chat. In the meantime, I hope you'll find lots of opportunities to use your magnifier! Bye!"
    ],
    "perseverance": [
        "Practice makes perfect. Are you up for doing a little more reading today, {'db': 'user name', 'default value': ''}?",
        "The more time one spends practicing an activity, the better they will get. How about if you try another reading task right now?",
        "I believe that you're going to be more likely to improve with your magnifier if you spend more time practicing with it. Are you willing to spend some more time right now on another reading task?",
        "The more you do something, the better you will get at it. Are you motivated to complete another reading task right now?",
        "It's been said that it takes 10,000 hours to become an expert. You won't need to spend thousands of hours reading with your magnifier, but I would like to ask if you are able to try another reading task for just a few minutes right now to get closer to becoming an expert?",
        "Some people say: 'Don't practice until you get it right, practice until you don't get it wrong.' How about some more magnifier practice time right now with one of the reading tasks?"
    ],
    "plan next checkin": [
        "That's OK {'db': 'user name', 'default value': ''}, let's plan to chat another time today. When is good for you?",
        "No worries {'db': 'user name', 'default value': ''}, that's fine. We can pick another time to {'var': 'chat'}. Let me know your preference.",
        "That's OK {'db': 'user name', 'default value': ''}, no problem. We can set another time to {'var': 'chat'}. Let me know what time works for you.",
        "That's just fine {'db': 'user name', 'default value': ''}, we can arrange to {'var': 'chat'} again later. When is a time that works well?",
        "That's quite alright {'db': 'user name', 'default value': ''}, maybe next time. When are you available to {'var': 'chat'} again?",
        "That is totally fine {'db': 'user name', 'default value': ''}, perhaps I can tell you a story when we {'var': 'chat'} again. When should we plan to interact again?"
    ],
    "mindfulness": [
        "I think it would be good to take a little time to reset and take your mind off reading. I would like to try to make you feel a bit better. Let's see if we can reduce some of your stress, frustrations, or negativity, by redirecting your thoughts to enhance your performance, gain insight or awareness to set you up for success for the rest of the day.",
        "I think it would be great if we can take a little break now. Let's redirect our focus and take some time to relax."
    ],
    "IReST": [
        "This reading task involves reading a single paragraph aloud while using your magnifier. I would like to see how quickly and accurately you can read today. I'm curious to know what is written there today."
    ],
    "MNread": [
        "This reading task involves reading single sentences, going from large print to very tiny, fine print. You can start without your magnifier for the larger sentences and then remember to use your magnifier when the sentences become more difficult to read as they get smaller. They get so small that no human can read them, so don't get discouraged when you can't read all of them. Try to read them as quickly as possible, without making mistakes. Go ahead and show me how well you can read this today."
    ],
    "SKread": [
        "This reading task involves using your magnifier to read aloud a series of single words that are grouped according to size from large to tiny. Do your best to figure out each word, one by one, and remember that these are not sentences, only individual words. Give it your best shot to read the words as fast as you can, while trying to get them all correct. I can't wait to see how you do today!"
    ],
    "spot reading": [
        "This reading task involves spot reading the numbers on common household items. Please read the numbers aloud to me and then also enter them on the tablet. For each item, I will ask you to find and read something specific that is of interest to me on the item while using your magnifier. Do your best to read the numbers on the items accurately."
    ],
    "SSRT": [
        "This reading task is a short story, like you would read in a book, and I'd like you to try to read aloud three pages of it to me, as quickly as you can without making errors. I can't wait to hear what happens in the story today!"
    ]
}