{
  "ask to chat": [
    "{'var': 'Hi'} there! Is this a good time to {'var': 'chat'} with me?",
    "{'var': 'Hi'} my friend! Are you able to {'var': 'chat'} with me right now?",
    "Greetings! Am I catching you at a good time to {'var': 'chat'}?",
    "{'var': 'Hi'} {'db': 'user_name'}! Let me know if this is a good time to {'var': 'chat'}?"
  ],
  "did you use magnifier": [
    "Tell me, did you use your magnifier since we last spoke?",
    "I'm curious if you have used your magnifier since the last time that we {'var': 'chatted'}?",
    "Please update me on whether you tried your magnifier since the last time we {'var': 'chatted'}?",
    "I'd love to know if you had a chance to use your magnifier since we last {'var': 'chatted'}?",
    "Next, I am eager to find out if you had an opportunity to read with your magnifier since the last time we {'var': 'chatted'}?",
    "Since the last time that we {'var': 'chatted'}, were you able to use your magnifier?",
    "Next, please fill me in on whether you read with your magnifier since we last {'var': 'chatted'}?"
  ],
  "ending": [
    "That was great! {'var': 'Bye'} for now, and don't forget to use your magnifier!",
    "That was great! {'var': 'Bye'} until we can chat again, And be sure to use your magnifier!",
    "I really enjoyed chatting with you today! Please remember to use your magnifier! Hope the rest of your day is great!",
    "I loved having this chance to interact with you today! Keep up the good work with your magnifier! {'var': 'Bye'}!",
    "It's so great to be able to chat with you each day! Keep using your magnifier for those tough reading tasks! {'var': 'Bye'}!",
    "OK, it's time to say {'var': 'Bye'}, but I am looking forward to the next time we can chat. In the meantime, I hope you'll find lots of opportunities to use your magnifier! {'var': 'Bye'}!"
  ],
  "ending joke": [
    "Before we say goodbye, I'd like to tell you one of my favorite jokes about eyes and vision.<break time=\"1s\"/> *QT/emotions/shy* Knock knock, <break strength=\"x-strong\"/><prosody pitch=\"high\">who's there</prosody><break time=\"0.5s\"/>? Eyeball. <break time=\"0.5s\"/>Eyeball who? <break time=\"0.5s\"/> Eyeball my eyes out every time you go! <break strength=\"x-strong\"/>*QT/bye-bye**happy* Goodbye for now {'db': 'user_name', 'default value': ''}",
    "Before we say goodbye, I'd like to tell you one of my favorite jokes about robots.<break time=\"1s\"/> I'm so good at sleeping, I can do it with my eyes closed!*QT/bye-bye**happy* Goodbye for now {'db': 'user_name', 'default value': ''}!"
  ],
  "glad to hear": [
    "I'm so glad to hear things are ok with you.",
    "I am happy to know that your day is going just fine.",
    "{'var': 'Great'}, my day is going well too! Amd it's even better now that I get to talk with you!",
    "I am also doing well and I am really happy to be able to {'var': 'chat'} with you now.",
    "It's {'var': 'great'} to know that things are fine with you.",
    "I am pleased to hear that your day is going well so far.",
    "That's {'var': 'great'} to hear that you are doing well today.",
    "It is a {'var': 'great'} day that gets even better for me when you're around!"
  ],
  "i am sorry": [
    "*QT/emotions/sad* I'm <prosody rate=\"slow\" pitch=\"low\">sorry</prosody> to hear that. Perhaps <prosody pitch=\"high\">I</prosody> can <prosody rate=\"slow\">help</prosody> a bit.",
    "We all have rough days sometimes. Maybe I can help you feel a little better.",
    "Sometimes life can be tough. But together we can get through it.",
    "When life gives you lemons, make lemonade. I'm sure you can work through it.",
    "Even when life is difficult, I'm here for you.",
    "Life has its challenges, but please know that I'll be right by your side to try to make you feel better.",
    "We all face challenges, so I am here to face them with you. How about if I try to cheer you up a bit?"
  ],
  "plan to talk again": [
    "No problem, I understand. Let's plan to {'var': 'chat'} another time. When is good for you?",
    "No worries, that's fine. We can pick another time to {'var': 'chat'}. Let me know your preference.",
    "That's ok, no problem. We can set another time to {'var': 'chat'}. Let me know what time works for you.",
    "That's just fine, we can arrange to {'var': 'chat'} again later. When is a time that works well?",
    "That's quite alright, maybe next time. When are you available to {'var': 'chat'} again?",
    "That is totally fine, perhaps I can tell you a story when we {'var': 'chat'} again. When should we plan to interact again?"
  ],
  "read me something": [
    "I love stories and jokes. Will you read me a story or tell me a joke? Or show me something that has been tough to read with your magnifier?",
    "I really enjoy stories and jokes. Will you read something interesting to me or tell me a funny joke? Or show me something that has been challenging to read with your magnifier?",
    "Now it's your turn to entertain me with a story or joke. Will you please read to me or tell me a good joke? Or show me something that has been difficult to read with your magnifier?",
    "Now it's your turn to share a story or joke with me, if you can think of one? Or if there has been anything that has not been easy to read with your magnifier, you can show me what it is?",
    "Did you know that I really appreciate a good story or a funny joke? Do you have one that you could share with me right now? Or I would be interested to see any of your own reading materials or items that have been more challenging to read with your magnifier?",
    "Can you tell that I am quite fond of good stories and funny jokes? Do you happen to know one or can you find one to read to me now? Or if you have been struggling with any of your own reading items, could you please show me what it is?"
  ],
  "response to excellent": [
    "{'var': 'Great'}! I'm so proud of you for doing so well. Keep up the {'var': 'great'} work with you magnifier!",
    "I knew that you had it in you to become really excellent with your magnifier! Congrats! Your hard work has paid off!",
    "I am really thrilled to learn that you have become a super-duper magnifier user! That's incredible!",
    "I'm overjoyed to know that your magnifier use is so fantastic now! You deserve to be very satisfied with this accomplishment!",
    "If I could jump, I would jump for joy right now! Your improved magnifier use is quite an achievement!",
    "That's really {'var': 'great'} that you have attained such success with your magnifier! It was not an easy undertaking, but you did it!",
    "You should be very proud of yourself for all you have accomplished with your magnifier! That is so {'var': 'great'} that you have finally mastered it!"
  ],
  "response to fair": [
    "Let's see how we can make things better with practice. How about if we pick a number of tries and do that many each day. Let's go for 2! It's not important that things go great each time, it's just important that you give it a good try. How about it?",
    "Well I'm sure you know the old adage, practice makes perfect, and I know you can achieve it! Are you up for the challenge?",
    "Keep at it, even when it's tough, and your effort will surely pay off in time. I can't wait to witness your progress!",
    "It can be quite the challenge to work with a new magnifier, but it will get better. Even though it might be a tough journey at times, envision yourself accomplishing everything you want with your magnifier. The future you see, is the person you will be.",
    "Success involves the courage to continue when things are tough. Don't wish it were easier, instead, wish you were better and work to make that dream a reality by persevering with your magnifier each and every time."
  ],
  "response to frustrated": [
    "{'db': 'user_name'} I know it's more difficult to do things with your vision, but together we can get through it.",
    "{'db': 'user_name'} I realize that it is more challenging to do things with your vision, but I am here for you.",
    "{'db': 'user_name'} I understand that it is not easy to read with your vision, but I am here to help support you while learning to use your magnifier.",
    "{'db': 'user_name'} I bet that there are some things that are difficult to see, but stick with your magnifier while working with me, and reading should become easier with practice.",
    "{'db': 'user_name'} All people with vision loss get frustrated at times, but together we can overcome it. If you keep working with your magnifier, I bet you'll improve and feel less frustrated.",
    "{'db': 'user_name'} It's totally normal to feel frustrated sometimes, and the more you work at using your magnifier, it will get better!"
  ],
  "response to good": [
    "I am glad to hear it's going pretty well. Here's my advice: Let's aim to become great with your magnifier. I know that you can get there! Your future self will thank you.",
    "Alright, let's aim high to get really great while reading with your magnifier. Keep at it, you're getting there!",
    "Let's create the intention to achieve even greater success with your magnifier! With some more practice, you will get there!",
    "I'm impressed that you're already doing pretty good! Just remember that the key to even greater success is to set a goal to persist through any difficulties. I believe in you! You can do it!",
    "It's good that you're staying pretty positive about your magnifier use. Let's strive to get even better!  Success is the result of intention, hard work, and learning when things don't go perfectly. You've got this!"
  ],
  "response to no concerns": [
    "That's good to hear. Since you don't have any vision-related worries today,",
    "I am glad to hear that you're not frustrated with your vision. Since you are doing fine with your vision today,",
    "I'm happy that your vision is not frustrating you. Since that's the case, ",
    "That is great news that you don't have any vision-related concerns. I would like to propose that you try using your vision to read for a little bit,",
    "I am pleased that you are doing fine with your vision. How about if you work at using your vision to read for a little while?",
    "I'm delighted that you are doing alright with your vision. I would love to see how you are doing with your magnifier today."
  ],
  "response to poor": [
    "I am so sorry that it has been hard to use the magnifier! It takes time to get better at it. Let's set a goal for tomorrow to just give it a try and not feel bad about however it goes. Each try counts, so you should feel good about trying.",
    "I know it can be extremely difficult when first learning to use your magnifier. Next time you try, set an intention to just attempt it for an easy task and be proud of yourself for not giving up, no matter how it goes. And don't forget to keep in mind all of your optometrists' tips on how to use the magnifier the right way. ",
    "I realize that there will be days when it doesn't seem to be going well at all. How about if we make a plan to try to stay positive and keep working at it, even when it's difficult. Every day that you try, it will get a little easier if you keep attempting to use it the correct way.",
    "It may be really tough right now but you are capable of more than you believe possible. How about you set an aspiration to work with the magnifier later today or tomorrow without judgment about how it's going. With a little determination, you will see some progress each day!",
    "It is not unusual to struggle with magnifiers. The only place where success comes before work is in the dictionary. Set the goal to work toward being more successful with the magnifier over time by trying the right way and being ok with however it's going. Goals are not only absolutely necessary to motivate us; they are essential to keep us alive."
  ],
  "Bye": [
    "Bye",
    "Bye-bye",
    "Good-bye"
  ],
  "chat": [
    "chat",
    "speak",
    "talk"
  ],
  "chatted": [
    "chatted",
    "talked",
    "spoke"
  ],
  "great": [
    "great",
    "terrific",
    "fantastic",
    "fabulous",
    "excellent",
    "wonderful",
    "awesome",
    "super"
  ],
  "Great": [
    "Great",
    "Terrific",
    "Fantastic",
    "Fabulous",
    "Excellent",
    "Wonderful",
    "Awesome",
    "Super"
  ],
  "Hi": [
    "Hi",
    "Hello"
  ],
  "joke category": [
    "{'var': 'robot joke'}",
    "{'var': 'science joke'}",
    "{'var': 'vision joke'}"
  ],
  "joke": [
    "I <prosody rate=\"slow\">love</prosody> funny jokes, like this one. {'var': 'joke category'}",
    "I happen to know a bunch of funny jokes; let me share one with you. {'var': 'joke category'}",
    "Life is so much easier when you have a great sense of humor. Let me share a joke with you! {'var': 'joke category'}"
  ],
  "news story": [
    "<prosody rate=\"slow\">George Ahearn, who grew up in the farming town of Othello, Washington, co-founded EastWest Food Rescue after learning that Covid-19 was costing local farmers so much business that they were willing to destroy their crops. His non-profit has since moved three million pounds of produce from farms in eastern Washington to the western part of the state for distribution to hundreds of food banks and meal programs. Ahearn has a message for anyone who wants to make their community a better place, \"I have seen minutes of effort move thousands, and thousands of pounds of food. Just figure out what you are passionate about and what you could get involved in.\"</prosody>"
  ],
  "robot joke": [
    "What is a robot's favorite snack? <break time=\"0.75s\"/>*QT/yawn*<prosody volume=\"loud\" rate=\"slow\"*happy*Computer</prosody> <prosody rate=\"slow\" pitch=\"high\">chips</prosody>. Chomp, chomp!",
    "What is it called when a robot eats a sandwich in one chomp?*QT/yawn*<break time=\"0.75s\"/> A megabyte.",
    "Why did the robot marry his fiancee? <break time=\"0.75s\"/>*QT/happy*He couldn't resistor!",
    "Why did the robot go to the shoe shop? To get rebooted.",
    "A robot's collection of musical instruments will never be complete. They can never get any organs."
  ],
  "science joke": [
    "I'm reading a book about anti-gravity. <break time=\"0.75s\"/>It's impossible to put down!",
    "*QT/sad*Don't trust atoms. <break time=\"0.75s\"/>They make up everything!",
    "What's an astronaut's favorite part of a computer?<break time=\"0.75s\"/> *QT/happy*The space bar.",
    "Wanna hear a joke about paper?<break time=\"0.75s\"/>*QT/happy* Never mind - it's tearable."
  ],
  "vision joke": [
    "Why did the cell phone go see an optometrist?<break time=\"0.75s\"/>*QT/happy* It needed contacts.",
    "*question_1*<prosody rate=\"slow\">What</prosody> do you call <break strength=\"weak\"/>an optometrist on a boat?*QT/happy* <break time=\"0.75s\"/>A see captain!",
    "What do you call a <prosody rate=\"60%\" pitch=\"medium\">deer</prosody><break time=\"0.2s\"/> with <prosody rate=\"slow\">no eyes</prosody>?<break time=\"0.75s\"/>*QT/happy* <prosody rate=\"x-slow\">No idea!</prosody>",
    "What did the man with the magnifying glass say to the guy in the emergency room? ICU!",
    "Did you hear about the penny and magnifying glass who got married? Their wedding was magnify-cent.",
    "You know why women's eyes are so noticeable these days? It's the mask <break time=\"0.1s\"/>era during the pandemic.",
    "Did you hear that they make a webpage for people who suffer from chronic eye pain? It's a site for sore eyes.",
    "I love jokes about the eyes. The cornea the better."
  ]
}
